<a href="https://colab.research.google.com/github/kajalpanda1/ML-Assignments/blob/master/AutomobileDataset.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
from google.colab import files
uploaded=files.upload()

Saving Automobile_data.csv to Automobile_data (1).csv

In [ ]:
import io
data=pd.read_csv(io.StringIO(uploaded['Automobile_data.csv'].decode('utf-8')))

In [ ]:
data.head()

   index      company   body-style  ...  horsepower  average-mileage    price
0      0  alfa-romero  convertible  ...         111               21  13495.0
1      1  alfa-romero  convertible  ...         111               21  16500.0
2      2  alfa-romero    hatchback  ...         154               19  16500.0
3      3         audi        sedan  ...         102               24  13950.0
4      4         audi        sedan  ...         115               18  17450.0

[5 rows x 10 columns]

In [ ]:
data.tail()

    index     company body-style  ...  horsepower  average-mileage    price
56     81  volkswagen      sedan  ...          85               27   7975.0
57     82  volkswagen      sedan  ...          52               37   7995.0
58     86  volkswagen      sedan  ...         100               26   9995.0
59     87       volvo      sedan  ...         114               23  12940.0
60     88       volvo      wagon  ...         114               23  13415.0

[5 rows x 10 columns]

In [ ]:
data.columns

Index(['index', 'company', 'body-style', 'wheel-base', 'length', 'engine-type',
       'num-of-cylinders', 'horsepower', 'average-mileage', 'price'],
      dtype='object')

In [ ]:
data.isnull().sum()

index               0
company             0
body-style          0
wheel-base          0
length              0
engine-type         0
num-of-cylinders    0
horsepower          0
average-mileage     0
price               3
dtype: int64

In [ ]:
Price=data['price'].median

In [ ]:
data['price']=data['price'].fillna(Price)

In [ ]:
data=data.drop(columns='index')

In [ ]:
maxprice=

In [ ]:
data[['company','price']][data.price==data['price'].max()]

          company    price
35  mercedes-benz  45400.0

In [ ]:
data[data.columns][data.company=='toyota']

    index company body-style  ...  horsepower  average-mileage    price
48     66  toyota  hatchback  ...          62               35   5348.0
49     67  toyota  hatchback  ...          62               31   6338.0
50     68  toyota  hatchback  ...          62               31   6488.0
51     69  toyota      wagon  ...          62               31   6918.0
52     70  toyota      wagon  ...          62               27   7898.0
53     71  toyota      wagon  ...          62               27   8778.0
54     79  toyota      wagon  ...         156               19  15750.0

[7 rows x 10 columns]

In [ ]:
data.company.value_counts()

toyota           7
bmw              6
nissan           5
mazda            5
mercedes-benz    4
audi             4
volkswagen       4
mitsubishi       4
honda            3
porsche          3
jaguar           3
chevrolet        3
isuzu            3
alfa-romero      3
volvo            2
dodge            2
Name: company, dtype: int64

In [ ]:
data[['company','price']].groupby('company').max()

                 price
company
alfa-romero    16500.0
audi           18920.0
bmw            41315.0
chevrolet       6575.0
dodge           6377.0
honda          12945.0
isuzu           6785.0
jaguar         36000.0
mazda          18344.0
mercedes-benz  45400.0
mitsubishi      8189.0
nissan         13499.0
porsche        37028.0
toyota         15750.0
volkswagen      9995.0
volvo          13415.0

In [ ]:
round(data[['company','average-mileage']].groupby('company').mean(),2)

               average-mileage
company
alfa-romero              20.33
audi                     20.00
bmw                      19.00
chevrolet                41.00
dodge                    31.00
honda                    26.33
isuzu                    33.33
jaguar                   14.33
mazda                    28.00
mercedes-benz            18.00
mitsubishi               29.50
nissan                   31.40
porsche                  17.00
toyota                   28.71
volkswagen               31.75
volvo                    23.00

In [ ]:
data.sort_values('price',ascending='False')

          company body-style  wheel-base  ...  horsepower average-mileage    price
13      chevrolet  hatchback        88.4  ...          48              47   5151.0
27          mazda  hatchback        93.1  ...          68              30   5195.0
48         toyota  hatchback        95.7  ...          62              35   5348.0
36     mitsubishi  hatchback        93.7  ...          68              37   5389.0
28          mazda  hatchback        93.1  ...          68              31   6095.0
..            ...        ...         ...  ...         ...             ...      ...
11            bmw      sedan       103.5  ...         182              16  41315.0
35  mercedes-benz    hardtop       112.0  ...         184              14  45400.0
22          isuzu      sedan        94.5  ...          70              38      NaN
23          isuzu      sedan        94.5  ...          70              38      NaN
47        porsche  hatchback        98.4  ...         288              17      NaN

[61 rows x 9 columns]

In [ ]:
GermanCars = {'Company': ['Ford', 'Mercedes', 'BMV', 'Audi'], 'Price': [23845, 171995, 135925 , 71400]}
JapaneseCars = {'Company': ['Toyota', 'Honda', 'Nissan', 'Mitsubishi '], 'Price' : [29995, 23600, 61500 , 58900]}

In [ ]:
df1=pd.DataFrame(GermanCars)

In [ ]:
df2=pd.DataFrame(JapaneseCars)

In [ ]:
pd.concat([df1,df2],keys=["Germany","Japan"])

               Company   Price
Germany 0         Ford   23845
        1     Mercedes  171995
        2          BMV  135925
        3         Audi   71400
Japan   0       Toyota   29995
        1        Honda   23600
        2       Nissan   61500
        3  Mitsubishi    58900

In [ ]:
Car_Price = {'Company': ['Toyota', 'Honda', 'BMV', 'Audi'], 'Price': [23845, 17995, 135925 , 71400]}
Car_Horsepower = {'Company': ['Toyota', 'Honda', 'BMV', 'Audi'], 'horsepower': [141, 80, 182 , 160]}

In [ ]:
dataf1=pd.DataFrame(Car_Price)
dataf2=pd.DataFrame(Car_Horsepower)

In [ ]:
df_merged=dataf1.merge(dataf2)

In [ ]:
df_merged

  Company   Price  horsepower
0  Toyota   23845         141
1   Honda   17995          80
2     BMV  135925         182
3    Audi   71400         160